'use client';
import { Box, Card, CardContent, Typography } from '@mui/material';
import { JSX } from 'react';

/**
 * 利用規約Component
 * @returns {JSX.Element} JSX
 */
export const PrivacyComponent = (): JSX.Element => {
  /* sxプロパティ共通設定（個人情報保護方針と統一） */
  const textStyle = {
    whiteSpace: 'pre-wrap',
    lineHeight: 2.2,         
    letterSpacing: '0.05em',   
    color: 'text.primary'
  };

  return (
    <>
      <Card sx={{ borderRadius: 4, mt: 2, boxShadow: 2 }}>
        <CardContent sx={{ p: { xs: 2, sm: 4 } }}>
          {/* タイトル */}
          <Typography variant="h3" sx={{ fontSize: 22, mb: 4, fontWeight: 'bold', textAlign: 'center' }}>
            利用規約
          </Typography>

          {/* 第1条 「ユーザー」等の定義 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第1条 「ユーザー」等の定義
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 「当サイト」とは、株式会社みんなの社食（以下、弊社と言います）が提供・運営する[社食オーダーシステム]を指します。
              {"\n"}「ユーザー」とは、本規約を承諾のうえ、社食サービスの注文・利用のために当サイトをご利用いただく方を指します。
              {"\n"}「会員ユーザー」とは、ユーザー情報の登録・弊社による承認を経て、会員IDを持ったユーザーを指します。
              {"\n"}「加盟店」とは、当サイトに社食サービスの提供のための情報・広告を掲載する企業または店舗を指します。
              {"\n"}2. 当サイトは、加盟店とユーザーとの間で社食サービスの提供、注文、配送または受渡しに関する取引ができるサービス（以下、サービスと言います）を提供しています。加盟店とユーザーとの間の社食サービスの提供に関する契約および配送・受渡しに関する契約（以下、取引契約等といいます）は、双方の意思が合致したときに成立します。
              {"\n"}3. 弊社は、社食サービスに関する取引契約等に関して契約当事者として権利、義務および責任を一切有しておらず、取引契約等について一切責任を負うものではありません。
              {"\n"}4. 弊社が、ユーザーとして利用して頂くことを不適切と判断した場合、ご利用をお断りする場合があります。
            </Typography>
          </Box>

          {/* 第2条 規約の適用 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第2条 規約の適用
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              本規約は、当サイトにおける、第1条が定めるユーザーとの間のあらゆる関係において適用されます。
            </Typography>
          </Box>

          {/* 第3条 規約の変更 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第3条 規約の変更
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 弊社は、規約等（本規約および当サイトに掲載するサービスに関するルール、諸規定等を含みます。以下本規約において同じ）の内容を事前の予告無しに自由に変更できるものとします。
              {"\n"}2. 弊社は、規約等またはサービスの内容を変更した場合には、ユーザーに当該変更内容を当サイト上で公表するものとし、当該変更内容の公表後、ユーザーがサービスを利用した場合、または会員ユーザーが弊社の定める期間内に会員登録取消の手続をとらなかった場合には、ユーザー及び会員ユーザーは、規約の内容の変更に同意したものとみなします。
              {"\n"}3. 当該変更の内容に同意しないユーザーは、サービスの利用を停止して下さい。弊社は、当該内容の変更によりユーザーに生じた全ての損害について、弊社の故意または過失に起因する場合を除き、責任を負いません。
            </Typography>
          </Box>

          {/* 第4条 利用規約の遵守 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第4条 利用規約の遵守
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              ユーザーは、規約等（前条により変更された場合は、変更後の規約等も含む。）を理解し遵守する義務があります。
            </Typography>
          </Box>

          {/* 第5条 プライバシー */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第5条 プライバシー
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              ユーザーが当サイトの利用にあたり提供した情報は弊社の所有となり、弊社が責任をもって管理・保護いたします。また、ユーザーの個人情報については、弊社が別途定めるプライバシーポリシーに従って取扱うこと、個人情報が弊社と契約する加盟店に対して提供されることについてユーザーはあらかじめ同意するものとします。また、かかるプライバシーポリシーが変更された場合は、変更後のプライバシーポリシーが適用されることに同意するものとします。
            </Typography>
          </Box>

          {/* 第6条 会員ID、パスワードの管理 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第6条 会員ID、パスワードの管理
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 会員IDまたはパスワードの利用により発生した全ての責任や債務は、会員ユーザーの責任、および費用負担によって解決するものとし、弊社は一切責任を負いません。
              {"\n"}2. 会員IDまたはパスワードの管理は、会員ユーザーの責任において行われるものとします。会員IDまたはパスワードが第三者によって使用され、会員ユーザーに不利益、損害が発生した場合、弊社は一切その責任を負いません。
              {"\n"}3. 会員IDまたはパスワードの喪失、もしくは盗難の場合、会員ユーザーはただちに弊社に報告するものとし、その報告があった場合、弊社がその事態に気づいた場合には、会員IDまたはパスワードの使用を中止することがあります。
            </Typography>
          </Box>

          {/* 第7条 電子メールの送受信 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第7条 電子メールの送受信
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 会員ユーザーは、弊社が会員ユーザーへ送信するメールのうち、サーバーのメンテナンスに伴うサービス停止情報などサービス提供のために重要であると弊社が判断する情報を「重要なお知らせ」として提供することに関しては、配信を停止することが出来ないことを予め了承するものとします。
              {"\n"}2. 弊社は、会員ユーザーに対して、会員ユーザー向け企画などのお得な情報を, メールにて配信することがあり、これについて会員ユーザーはあらかじめ同意するものとします。ただし、会員ユーザーがメールの配信停止を希望する場合、弊社は可能な限り迅速に対応いたします。
            </Typography>
          </Box>

          {/* 第8条 注文情報の受け付け */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第8条 注文情報の受け付け
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. ユーザーが当サイト上、当サイトの加盟店に対し注文行為（以下、取引と言います）を行い、弊社がその注文情報を受け付けた場合、当サイト上にて、注文を受け付けた旨を表示し、その表示をもって受け付けを完了とします。
              {"\n"}2. 弊社は、受付完了の表示を行うと同時に、登録メールアドレス宛に、受付完了メールを送信します。ユーザーは、受付完了メールは、理由の如何を問わず、送信失敗、遅延、未着が発生する場合がある旨を予め了承するものとし、弊社は、これにより発生した一切の損害について、如何なる責任も負わないものとします。
              {"\n"}3. 前2項の注文受付完了表示および受付完了メールは、加盟店とユーザー間の取引契約等の成立を保証するものではなく、契約当事者間で契約成立の存否は判断するものとします。
            </Typography>
          </Box>

          {/* 第9条 禁止事項および会員登録の抹消・利用停止 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第9条 禁止事項および会員登録の抹消・利用停止
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              ユーザーが以下の項目に当てはまる場合及び行為をおこなった事が、発覚した際、弊社は何ら通知をおこなわず即時、利用停止、注文のキャンセル、（会員ユーザーである場合は、）会員登録の削除ができるものとします。（会員ユーザーである場合は、）今までご利用いただいていた会員ID・注文履歴情報も削除され、元に戻すことは出来ません。なお、これらの措置によりユーザーが何らかの損害を被ったとしても弊社は一切責任を負うものではありません。また、それに伴う返金措置は一切いたしません。これらの判断は全て、弊社に帰属し、ユーザーは一切の不服を唱えず、いかなる損害についても賠償請求しないものとします。
              {"\n"}1. 会員登録時およびサービス利用時の虚偽情報の記載
              {"\n"}2. スパム・メールや誹謗・中傷メールの配信、他社掲示板への書込みなど、弊社、他のユーザー、もしくは第三者を不快にし、または不利益をもたらすような行為
              {"\n"}3. システムへの侵入行為（ハッキング）、その他当サイトに対する攻撃行為等、当サイトの運営を妨害する行為
              {"\n"}4. 会員資格の営利目的での不正使用
              {"\n"}5. 公序良俗に反する行為
              {"\n"}6. 法令に違反する行為
              {"\n"}7. 弊社の記事、企画、投稿内容その他の無断転載・再配布
              {"\n"}8. 第三者会員ID、パスワードの不正使用
              {"\n"}9. 加盟店または弊社の営業を妨害する行為
              {"\n"}10. 登録いただいたメールアドレスもしくは電話番号が不通または、無効になっている場合
              {"\n"}11. 暴力団関係者及び反社会的組織に属している、または雇用している場合
              {"\n"}12. 前各号の他、弊社が不適切と判断した行為
            </Typography>
          </Box>

          {/* 第10条 損害・損失処理の責任 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第10条 損害・損失処理の責任
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. ユーザーが当サイトを利用し加盟店との取引によって損害や損失を被った場合、ユーザーと加盟店の間においてその損害や損失を処理・解決するものとし、弊社は、かかる損害・損失に対して如何なる責任も負いません。
              {"\n"}2. ユーザーが当サイトの利用によって第三者に対して損害や損失を与えた場合、ユーザーは自己の責任と費用負担によってその損害・損失を処理・解決するものとし、弊社は、かかる損害・損失に対して如何なる責任も負いません。
              {"\n"}3. ユーザーが本規約に違反した行為、あるいは不正、または違法な行為により当サイト、加盟店、および他のユーザーに損害を与えた場合、弊社は、当該ユーザーに対して相応の損害賠償請求を行う権利を有します。
            </Typography>
          </Box>

          {/* 第11条 入手情報の使用 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第11条 入手情報の使用
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              ユーザーは、弊社が事前に承認した場合を除き、当サイトを通じて入手した如何なる情報についても、ユーザー個人としての私的使用以外の目的に使用しないものとします。
            </Typography>
          </Box>

          {/* 第12条 著作権 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第12条 著作権
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 当サイトの著作権（著作権法第27条及び第28条の権利を含む。以下同じ）は、弊社に帰属します。この著作権の対象には、サイトの構成、デザイン、イラスト・写真等のグラフィクス、文章など、すべてを含みます。（但し、各加盟店ページ等に掲載する店舗情報・メニュー情報・写真データ等の著作権は、各加盟店に帰属し、弊社がその使用許諾を受けたものが含まれます。）事前に弊社からの書面による同意を受けずに、内容を転載・再配布することは著作権の侵害となり、弊社は罰金、および著作権侵害により発生した損害の賠償を求める権利を有します。
              {"\n"}2. 当サイトに掲載された投稿その他の著作物の著作権は、弊社に帰属するものとし、掲載されている投稿その他の著作物のすべて、あるいは一部を投稿者以外の第三者が弊社、および投稿者に無断で転載・再配布することを禁止いたします。また、ユーザーは、当サイトに掲載された著作物について、著作者人格権を一切行使しないものとします。
            </Typography>
          </Box>

          {/* 第13条 サイト内容の変更 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第13条 サイト内容の変更
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 弊社は、ユーザーの承認を受けることなく、サイトおよびサービス内容を変更、中止する場合があります。
              {"\n"}2. このような事態に伴い、ユーザーに不利益、損害が発生した場合でも、弊社はその責任を一切負いません。
            </Typography>
          </Box>

          {/* 第14条 サービスの中断、停止 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第14条 サービスの中断、停止
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              弊社では以下に該当する場合、ユーザーの承諾なしにサービスの一部、もしくはすべてを一時中断、または停止する場合があります。その際に生じた如何なる損害も弊社は一切の責任を負いません。
              {"\n"}1. 当サイト、ネットワークのシステム保守、更新、ならびに緊急の場合
              {"\n"}2. 火災、停電、天災などの不可抗力により、サービスの提供が困難な場合
              {"\n"}3. その他不測の事態により、当サイトのサービス提供が困難であると判断された場合
            </Typography>
          </Box>

          {/* 第15条 本規約の譲渡 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第15条 本規約の譲渡
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              弊社は、当サイトにかかる事業を第三者に譲渡した場合には、ユーザーの書面による事前の承諾なく、当該事業譲渡に伴い、本規約に基づく権利もしくは義務につき、第三者に対し、譲渡、移転、担保設定、その他の本規約に基づく権利及び義務並びにユーザーの登録事項その他の顧客情報を当該事業譲渡の譲受人に譲渡することができるものとし、ユーザーは、かかる譲渡につき本条において予め同意したものとします。なお、本条に定める事業譲渡には、通常の事業譲渡のみならず会社分割その他事業が移転するあらゆる場合を含むものとします。
            </Typography>
          </Box>

          {/* 第16条 免責事項および責任の制限 */}
          <Box pl={1} mb={4}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第16条 免責事項および責任の制限
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              1. 弊社は、ユーザーに対して通知義務を負う場合、ユーザーがあらかじめ登録した電話番号またはメールアドレスへの通知の発信、当サイト上での掲示、その他弊社が適切と判断する方法により通知を行うものとします。ユーザーの登録情報の誤り、受信設定、通信環境その他弊社の責めに帰すべき事由によらない通知の不着または遅延について、弊社は責任を負わないものとします。
              {"\n"}2. 弊社は、システム保守、通信回線の障害、天災地変、加盟店の事情、配送または受渡し上の事情、その他やむを得ない事由により、サービスの全部または一部を中断、停止、変更し、または注文をキャンセルする場合があります。この場合、弊社は、合理的な範囲でユーザーに通知するものとします。
              {"\n"}3. 弊社がユーザーに対しサービスを受け付けた旨を告知した後、加盟店または弊社の都合により当該サービスを承れない事由が発生した場合、加盟店または弊社は、ユーザーに対して当該サービスのキャンセルを通知することがあります。この場合において、ユーザーが当該サービスの対価を支払済みであるときは、弊社または加盟店は、別途定める方法に従い、当該対価を返金または精算するものとします。
              {"\n"}4. ユーザーの当サイトでの加盟店との取引は、別途弊社が明示して関与する場合を除き、ユーザーと加盟店との間で行われるものとします。取引に関してトラブルが生じた場合には、ユーザーと加盟店との間で解決するものとします。ただし、本項は、弊社に故意または過失がある場合の責任を免除するものではありません。
              {"\n"}5. サービスの提供の中断、停止、利用不能または変更、ユーザーのメッセージまたは情報の削除または消失、サービスの利用データの消失、機器の故障もしくは損傷、その他サービスに関連してユーザーに損害が生じた場合であっても、当該損害が弊社の責めに帰すべき事由によらないときは、弊社は責任を負わないものとします。弊社の重大な過失を除く過失によりユーザーに損害が生じた場合の責任については、第9項の定めによるものとします。
              {"\n"}6. 当サイトから他のサイトへのリンクまたは他のサイトから当サイトへのリンクが提供されている場合でも、弊社は、当サイト以外のサイトおよびそこから得られる情報について責任を負わないものとします。ただし、弊社の故意または過失によりユーザーに損害が生じた場合は、この限りではありません。
              {"\n"}7. 弊社は、本サービスの提供にあたり、通常講ずべき安全管理措置を講じるものとします。ただし、弊社の責めに帰すべき事由によらないコンピューター・ウィルスその他の有害なコンピューター・プログラムによる損害について、弊社は責任を負わないものとします。
              {"\n"}8. アレルギー情報、カロリー情報、商品説明その他の各種掲載情報は、主として加盟店から提供された情報に基づきます。弊社は、当該情報の正確性および最新性の確保に努めますが、その完全性、正確性、有用性等を保証するものではありません。食物アレルギーその他健康上の配慮が必要なユーザーは、注文前に加盟店または弊社に最新の情報を確認するものとします。
              {"\n"}9. 弊社が本規約または本サービスに関連してユーザーに損害賠償責任を負う場合であって、当該損害が弊社の重大な過失を除く過失による行為に基づくときは、弊社は、ユーザーに現実に生じた通常かつ直接の損害に限り、当該損害の原因となった注文についてユーザーが支払った金額を上限として賠償するものとします。
              {"\n"}10. 前項および本規約の他の条項における弊社の責任を免除または制限する規定は、弊社の故意または重大な過失によりユーザーに生じた損害、ユーザーの生命または身体に生じた損害、その他法令上責任の免除または制限が認められない損害については適用されないものとします。
            </Typography>
          </Box>

          {/* 第17条 準拠法及び管轄裁判所 */}
          <Box pl={1} mb={2}>
            <Typography variant="h6" fontWeight="bold" sx={{ mb: 1, fontSize: 18 }}>
              第17条 準拠法及び管轄裁判所
            </Typography>
            <Typography variant="body1" sx={textStyle}>
              本規約の準拠法は日本法とし、本規約に起因し、または関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
            </Typography>
          </Box>

        </CardContent>
      </Card>
    </>
  );
};
